---
kind: property
id: P:Autodesk.Revit.DB.FilteredWorksetIterator.CurrentObject
source: html/4fa892a1-6f90-4ec4-39fe-4f8e2b9d091e.htm
---
# Autodesk.Revit.DB.FilteredWorksetIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```